## Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
# for creating a dataframe
df = pd.DataFrame({'key1':[1,2,3,4,5,6],
                   'key2':[9,8,7,6,5,4]
                  })
df

   key1  key2
0     1     9
1     2     8
2     3     7
3     4     6
4     5     5
5     6     4

In [3]:
# for saving a file
df.to_csv('test.csv')

In [7]:
# for readind a data set
df1 = pd.read_csv('test.csv')

   Unnamed: 0  key1  key2
0           0     1     9
1           1     2     8
2           2     3     7
3           3     4     6
4           4     5     5
5           5     6     4

In [8]:
# for reading a data set
df1.head(3)

   Unnamed: 0  key1  key2
0           0     1     9
1           1     2     8
2           2     3     7

In [9]:
# for statistics
df.describe()

           key1      key2
count  6.000000  6.000000
mean   3.500000  6.500000
std    1.870829  1.870829
min    1.000000  4.000000
25%    2.250000  5.250000
50%    3.500000  6.500000
75%    4.750000  7.750000
max    6.000000  9.000000

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [15]:
df = pd.DataFrame({'A':[1,2,3,4,5,6],
                   'B':[9,8,7,6,5,4],
                   'C':[7,6,5,7,4,8]
                  })

In [27]:
df.index = range(1,len(df)*2,2)

In [28]:
df

    A  B  C
1   1  9  7
3   2  8  6
5   3  7  5
7   4  6  7
9   5  5  4
11  6  4  8

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [29]:
df = pd.DataFrame({'Values':[1,2,3,4,5,6]})

In [32]:
df['Values'].rolling(window=3).sum()

0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
5    15.0
Name: Values, dtype: float64

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [37]:
df3 = pd.DataFrame({'Text':["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards."]})

In [38]:
df3

                                                Text
0  Data Science Masters course is highly curated ...

In [40]:
df3['word_count'] = df3['Text'].apply(lambda x : len(x.split()))

In [41]:
df3

                                                Text  word_count
0  Data Science Masters course is highly curated ...          16

## Q5. How are DataFrame.size() and DataFrame.shape() different?

**DataFrame.size()** returns the total number of elements in a DataFrame, while **DataFrame.shape()** returns a tuple representing the dimensions of the DataFrame (number of rows, number of columns).

## Q6. Which function of pandas do we use to read an excel file?

In [43]:
# df = pd.read_excel('data.xlsx', sheet_name='Sheet1') # use sheet name when we have multiple sheets in our excel

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [44]:
df = pd.DataFrame({'Email':['username@domain.com', 'anurag972342@gmail.com', 'Colabanurag@gmail.com']})

In [50]:
df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])

In [51]:
df

                    Email      Username
0     username@domain.com      username
1  anurag972342@gmail.com  anurag972342
2   Colabanurag@gmail.com   Colabanurag

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [52]:
df = pd.DataFrame({'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]})

In [53]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [54]:
df2 = df[(df['A'] > 5) & (df['B'] < 10)]

In [55]:
df2

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2